[
    {
        "level": 1,
        "question": "Write a program which will find all such numbers which are divisible by 7 but are not a multiple of 5, between 2000 and 3200 (both included). The numbers obtained should be printed in a comma-separated sequence on a single line.",
        "source": "none"
    },
    {
        "level": 1,
        "question": "Write a program which can compute the factorial of a given numbers. The results should be printed in a comma-separated sequence on a single line.",
        "source": "none"
    },
    {
        "level": 1,
        "question": "With a given integral number n, write a program to generate a dictionary that contains (i, i*i) such that is an integral number between 1 and n (both included) and then the program should print the dictionary. Suppose the following input is supplied to the program: \\n8 \\nThen, the output should be: {1: 1, 2: 4, 3: 9, 4: 16, 5: 25, 6: 36, 7: 49, 8: 64}",
        "source": "none"
    },
    {
        "level": 1,
        "question": "Write a program which accepts a sequence of comma-separated numbers from console and generate a list and a tuple which contains every number.\\nSuppose the following input is supplied to the program:\\n34,67,55,33,12,98\\nThen, the output should be:\\n['34', '67', '55', '33', '12', '98']\\n('34', '67', '55', '33', '12', '98')",
        "source": "none"
    },
    {
        "level": 1,
        "question": "Write a program that accepts a comma separated sequence of words as input and prints the words in a comma-separated sequence after sorting them alphabetically.\\nSuppose the following input is supplied to the program:\\nwithout,hello,bag,world\\nThen, the output should be:\\nbag,hello,without,world",
        "source": "none"
    },
    {
        "level": 1,
        "question": "Write a program that accepts sequence of lines as input and prints the lines after making all characters in the sentence capitalized.\\nSuppose the following input is supplied to the program:\\nHello world\\nPractice makes perfect\\nThen, the output should be:\\nHELLO WORLD\\nPRACTICE MAKES PERFECT",
        "source": "none"
    },
    {
        "level": 2,
        "question": "Write a program which accepts a sequence of comma separated 4 digit binary numbers as its input and then check whether they are divisible by 5 or not. The numbers that are divisible by 5 are to be printed in a comma separated sequence.\\nExample:\\n0100,0011,1010,1001\\nThen the output should be:\\n1010",
        "source": "none"
    },
    {
        "level": 2,
        "question": "Write a program, which will find all such numbers between 1000 and 3000 (both included) such that each digit of the number is an even number.\\nThe numbers should be printed in a comma-separated sequence on a single line.",
        "source": "none"
    },
    {
        "level": 2,
        "question": "Write a program that accepts a sentence and calculate the number of letters and digits.\\nSuppose the following input is supplied to the program:\\nhello world! 123\\nThen, the output should be:\\nLETTERS 10 DIGITS 3",
        "source": "none"
    },
    {
        "level": 2,
        "question": "Write a program that accepts a sentence and calculate the number of upper case letters and lower case letters.\\nSuppose the following input is supplied to the program:nHello world!\\nThen, the output should be:\\nUPPER CASE 1\\nLOWER CASE 9",
        "source": "none"
    }
]